// pages/guanggao2/guanggao2.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    textList:[{text1:'坚持谷类为主的平衡膳食模式。每天的膳食应包括谷薯类、蔬菜水果、畜禽鱼蛋奶和豆类食物。平均每天摄入12种以上食物，每周25种以上，合理搭配。每天摄入谷类食物200～300g，其中包含全谷物和杂豆类50～150g；薯类50～100g。'},
    {text2:'平衡膳食模式是根据营养科学原理、我国居民膳食营养素参考摄入量及科学研究成果而设计，指一段时间内，膳食组成中的食物种类和比例可以最大限度地满足不同年龄、不同能量水平的健康人群的营养和健康需求。合理膳食是在平衡膳食的基础上，考虑到健康状况、地域资源、生活习惯、信仰等情况而调整的膳食，能较好地满足不同生理状况、不同信仰以及不同健康状况等某个阶段的营养与健康需要。'},
    {text3:'食物多样指一日三餐膳食的食物种类全、品样多，是平衡膳食的基础。'},
    {text4:'合理搭配是平衡膳食的保障。合理搭配是指食物种类和重量的合理化，膳食的营养价值通过合理搭配而提高和优化。中国居民平衡膳食宝塔是将五大类食物的种类和重量合理搭配的具体表现。'},
    {text5:'01小份量多几样图片02同类食物常变换图片03不同食物巧搭配'},
    {text6:'食物多样是实践平衡膳食的基础，食物多样、平衡膳食才能满足人体的营养需要。合理搭配是实现平衡膳食的关键，只有将各类食物的品种和数量合理搭配才能实现平衡膳食的目标。 谷类食物是人类最经济、最重要的能量来源。目前我国许多居民存在膳食结构不合理的问题，特别是成年人摄入供能食物的数量及比例搭配不合理。平衡膳食可提高机体免疫力，降低心血管疾病、高血压、2型糖尿病、结直肠癌、乳腺癌的发病风险。'}]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})